#############################
#R语言基础知识篇
#R语言学习第2集 
#认识R和RStudio?
#############################

# 包括3个内容

# 1 认识R软件

# 2 认识RStudio软件和常用配置

# 3 我实际工作常用的快捷键
# 1 重启RStudio Ctrl + Shift + F10
# 2 R代码注释 Ctrl + Shift + C
# 3 运行所选代码快捷键 Ctrl + Enter
# 4 运行全部代码快捷键 Ctrl + Shift + Enter
# 5 插入赋值符号 Alt + -
# 6 插入管道符号 Ctrl + Shift + M
# 7 插入自定义函数的注释模板 Ctrl + Shift + Alt + R
# 8 R脚本插入层次结构 Ctrl + Shift + R
# 9 R源程序运行 Ctrl + Shift + S

1 + 2


# 1 加载R包 ------------------------------------------------------------------

# 欢迎和我学用R语言，添加我微信：luqin360，备注：RStudy。
